import streamlit as st
from pprint import pprint
from paddlenlp import Taskflow
from tqdm import *
# 引入pandas库
import pandas as pd
import re
from io import BytesIO
import datetime


def remove_non_gb2312(text):
    res = []
    for char in text:
        try:
            char.encode('GB2312')
            res.append(char)
        except UnicodeEncodeError:
            pass
    return ''.join(res)


def get_opt(text):
    schema = ['主推产品']

    # 设定抽取目标和定制化模型权重路径
    my_ie = Taskflow("information_extraction", schema=schema, task_path='./model')

    opt = "########原文########\n"+text+"\n\n########输出结果########\n"

    cnt = 1
    text = remove_non_gb2312(text)
    temp = my_ie(text)
    if '主推产品' in temp[0]:
        for j in temp[0]['主推产品']:
            if j['probability'] >= 0.5:
                opt = opt + "id:" + str(cnt) + "\n    text:" + j['text'] + \
                      "\n    prob:" + str(j['probability']) + '\n'
                cnt = cnt + 1
    return opt


def get_label(r1, r2, my_ie):
    if pd.isnull(r1):
        r1 = ""
    if pd.isnull(r2):
        r2 = ""
    text = remove_non_gb2312(r1+'\n'+r2)
    temp = my_ie(text)
    opt = ""
    cnt = 1
    if '主推产品' in temp[0]:
        for j in temp[0]['主推产品']:
            # 删除低概率的判定结果
            if j['probability'] >= 0.5 and len(j['text']) < 50:
                opt = opt + "text" + str(cnt) + ":" + j['text'] + ";\n"
                cnt = cnt + 1
    return opt


schema = ['主推产品']
uploaded_file = ".\\data\\da1.xlsx"
df = pd.read_excel(uploaded_file)
# 逐行读取第一列和第二列的内容，计算f(col1, col2)，并将结果保存到第三列
my_ie = Taskflow("information_extraction", schema=schema, task_path='./model')

# .read() 会返回 bytes, 所以我们要把它转换成字符串
# 逐行读取第一列和第二列的内容，计算f(col1, col2)，并将结果保存到第三列
df[2] = df.apply(lambda row: get_label(row[0], row[1], my_ie), axis=1)
# st.write(df)

# 将DataFrame转化为Excel并存储在BytesIO对象中
# excel_file = BytesIO()
# df.to_excel(excel_file, index=False)
# 重置指针位置
# excel_file.seek(0)
# 将dataframe写入excel文件
current_time = datetime.datetime.now()
df.to_excel('.\\data\\'+current_time.strftime("%Y_%m_%d %H_%M_%S")+'.xlsx', index = False)

# # 使用st.download_button创建一个可以下载Excel文件的按钮
# st.download_button(
#     label="下载Excel文件",
#     data=excel_file,
#     file_name='output.xlsx',
#     mime='application/vnd.openxmlformats-officedocument.spreadsheetml.sheet'
# )

# temp=get_opt(x)
# print(temp)
1
# from pprint import pprint
# from paddlenlp import Taskflow
# from tqdm import *
# # 引入pandas库
# import pandas as pd
#
# def checkifin(labels,ans):
#     for i in labels:
#         for j in ans:
#             if '产品' in j:
#                 for k in j['产品']:
#                     if i in k['text']:
#                         return True
#             if '品牌' in j:
#                 for k in j['品牌']:
#                     if i in k['text']:
#                         return True
#     return False
#
# def easytest(text :list):
#     schema = ['主推产品']
#
#     # 设定抽取目标和定制化模型权重路径
#     my_ie = Taskflow("information_extraction", schema=schema, task_path='./checkpoint/model_best')
#
#     opt = []
#
#     for i in text:
#         temp = {}
#         temp["原文"] = i
#         temp1 = my_ie(i)
#         temp["预测结果"] = []
#         if '主推产品' in temp1[0]:
#             for j in temp1[0]['主推产品']:
#                 if j['probability'] >= 0.5:
#                     temp["预测结果"].append(j)
#         opt.append(temp)
#     return opt
#
#
#
# text = [
#     """《雅诗兰黛白金黑松露精华，自己兑换了》
#     刷了好几天没我的份，自己兑一个吧，谁让积分快到期了。
#     这个精华也不知道好不好用，去年就买了俩到现在也没打开用，求闺女给我时间让我好好护肤ヾ ^_^♪ #雅诗兰黛 #白金黑松露精华 #雅诗兰黛白金黑松露精华""",
#     """《好货我先尝 珀莱雅家果然出精品》珀莱雅他们家这个冻膜新品我有点子惊到了！
#     效果是真的有的！
#     前一天晚上脸还有点红红
#     20分钟厚厚敷一层之后（因为太舒服我敷的时间加长了一点）退红的效果肉眼可见，皮肤感觉白净稳定了hin多（因为红下去了）
#     而且上脸水嫩水嫩的，肤感一级棒
#     冰冰凉凉的跟夏天绝配，是懂消费者的爱好的
#     半透明果冻质地，流动性不错没有油膜感，带补水效果，嫩嫩的绿色我爱不释手
#     加的悦肤宁，维生素b5还有类肝素钠（啥喜啥妥管红印的就是它起的效果）
#     油敏肌真的会爱不释手，能够当晒后救急，维稳镇定舒缓，长久用还带修护
#     不仅仅是舒缓补水，更多通路应对敏敏敏
#     果然珀莱雅家出的都是精品
#     一大罐也不贵，急救这块咔咔上分""",
#     """《“粽”是要宠粉🥰珀莱雅双抗面膜免费送啦‼》
#     🔔叮咚~端午节小长假已到账！
#     出门游玩的宝们看这里[斜眼R]贴心好礼[礼物R]已就位，上汽大众就宠你！
#     💥珀莱雅双抗面膜2.0保湿补水面膜，0⃣元免费送啦！
#     ☀盛夏出游get轻透肌，[自拍R]一键开启治愈系小长假~还不快🐛！
#
#     🌟参与奖品🌟：珀莱雅双抗面膜2.0保湿补水面膜
#
#     🥳参与方式🥳：3天小长假准备去哪里玩~💭混眼熟，揪🖐位宝子送！
#
#     ⏰参与时间⏰：6月22日-7月21日
#
#     🌟开奖时间🌟：7月22日15:00
#
#     开着棣棣同款新途岳，和👭小姐妹们共赴一场⛱夏日之约！超大后备箱一口气装下所有出门必备品🧳，旅行出游说走就走🚘！IQ. Drive智能驾驶辅助系统，🚥智能保持车距调整车速，跟车更安心~解放双脚👋告别驾驶焦虑~好开又炫酷的车车真的太爱了！💓心动的宝子们速速冲呀！
#
#     🤫悄悄说一句，[私信R]还有王鹤棣X新途岳限定胶囊[礼物R]随机掉落哦~快拉上你的小姐妹来混眼熟！[星R]想要的宝子快快行动起来！[庆祝R]冲冲冲！ #上汽大众 #上汽大众创造真实的美好 #做我的粉丝我宠你 #宠粉福利 #抽奖 #抽奖活动 #福利免费送 #薅羊毛 #端午节 #宝藏面膜 #欧莱雅双抗精华面膜 #补水面膜 #端午小长假 #端午 #端午出游""",
#     """《6支高级感男士香水｜夏日必备高段位香水》
#     -
#     6支高段位男香，好高级好迷人
#     夏天穿起来！！！[扯脸H]
#     -
#     1️⃣ Atelier Versace范思哲高定｜无花果
#     无花果枝叶的青绿气息与橘子的清甜丝丝交融，橙花油的香气干净明亮。无花果不会过分地奶，更多的是植物气息。几种香气平衡地恰到好处，穿这支香就很有品味，日常实穿度高且不会撞香。
#     -
#     2️⃣ Salvatore Ferragamo菲拉格慕｜飨宴
#     充满阳光气息的意大利佛手柑与葡萄柚清甜的果香交织，柏树散发清冽的绿意，克什米尔木与乳香营造出了粉质感的木质焚香气息，温润而内敛。阳光透过树叶照耀着，微风包裹着绿意吹来，美得那么不真实。
#     -
#     3️⃣ CREED信仰｜拿破仑之水
#     香柠檬清爽干净，茉莉花香淡雅怡人，清甜不腻。广藿香的微弱苦感与烟熏感的菠萝果香碰撞出和谐愉悦的氛围。温润干净的雪松与果香过渡得十分柔和，百闻不腻。这一支日常通勤、商务场合、休闲等场景都很适合。
#     -
#     4️⃣ Miller Harris米勒海莉诗｜午后伯爵茶
#     柠檬的酸涩迸发而出，茶香慢慢显现，带有一丝发酵感的红茶与柠檬的清爽微凉融合，木质调的加入增添了茶香底蕴。午后的时光慵懒惬意，来一杯清爽的柠檬冰红茶真如点睛之笔。
#     -
#     5️⃣ ACQUA DI PARMA帕尔玛之水｜纯净之水
#     柠檬混合苦橙叶带来清新自然，茉莉与水仙花香温柔袭来，一丝丝皂感的涌现更显干净的气质。微苦而清冷的雪松与洁净的麝香，让香气清澈怡人，仿佛高山上的潺潺溪流，纯净无比。
#     -
#     6️⃣ Atelier Cologne欧珑｜流金木香
#     充满阳光气息的木质香，干净略带皂感气息的橙花油与木质香交融，香根草透着淡淡的泥土气息。仿佛午后的阳光穿过树木，金色的光影洒在大地，木质气息随光影若隐若现。
#     -
#     男士香水  香水分享  香水推荐  小众香水  香水瓶也有高颜值  香水测评  香水  男女通吃的中性香水  AtelierVersace  范思哲高定无花果  菲拉格慕香水  菲拉格慕飨宴  creed  Creed拿破仑  MillerHarris  米勒海莉诗午后伯爵  帕尔玛之水  欧珑  福利社先锋美妆店  小红书福利社好物安利
#     @美妆薯 @美妆情报局 #福利社先锋美妆店 #香水分享 #菲拉格慕飨宴 #男士香水 #creed #香水测评 #MillerHarris #菲拉格慕香水 #香水瓶也有高颜值 #帕尔玛之水 #欧珑 #米勒海莉诗午后伯爵 #男女通吃的中性香水 #小红书福利社好物安利 #小众香水 #AtelierVersace #香水推荐 #范思哲高定无花果 #香水 #Creed拿破仑"
#     """,
#     """《能不能快点上市❗今夏巨牛修红战神🆘》
#     本身皮肤底子不好又爱跟风刷🍋
#     所以每到换季的时候，整张脸红的就像猴屁股一样
#     正值盛夏我在户外待一个小时以上，
#     脸上就会有非常不舒服的灼热感
#     也曾尝试过大大小小的修红面霜、修红精华
#     但脸上的泛红就像春风吹又生一般，怎么都灭不干净💢
#     直到前段时间刷到国外朋友推荐的雅诗兰黛SOS闪修精华✨
#     据说修红效果贼🐂🍺而且连do脸之后的泛红都能轻松应对，这可太戳我了！
#     用完咱们真的很想尖叫！能不能像你的名字一样闪电般上市啊！
#     它在我这儿真就是2023年的天降紫薇星！！
#     -
#     原谅我现在来给你们分享，
#     毕竟这是我从海外淘来的，国内还没有上市
#     💢雅诗兰黛搞快点！！别再犹抱琵琶半遮面了（超大声📣）
#     我现在手里这瓶已经舍不得再用了～！已经快被我用光了啊啊啊啊！
#     我也去仔细研究扒了一下它为什么这么牛，主要有点担心是有啥猛成分
#     首先要知道导致我们皮肤反复泛红敏感的罪魁祸首
#     就是藏在肌底的泛红母体IL-1α
#     📣IL-1α姐妹们！都给我记住它🦠
#     什么泛红因子IL-6、IL-8都得听它的指挥～
#     据我所知，市面上其他的修红精华针对的都是IL-6、IL-8
#     但是光光解决它们可没什么用，要抓住老大IL-1α才是王道啊
#     SOS闪修精华牛就牛在它的特研闪修配方
#     👑 律波肽➕纾缓酵母蛋白➕15%高浓度二裂酵母
#     绝不是概念性添加！而且直接把每个成分的浓度拉满
#     尤其是被整个行业都在碰瓷儿的修护巨头二裂酵母
#     他们这次不计成本的拉到了15%的浓度！！
#     三大黄金成分强强联合，各自拿出自己的看家本领💃🏻
#     用36计中第18技：擒贼先擒王
#     压根没把那些小兵小将看在眼里
#     卯足了劲地狙击泛红成因母体IL-1α🏕
#     摧毁他们的主力，让泛红彻底瓦解
#     而且后续小兵们只要有一点造反的念头就直接封杀掉它，彻底摆脱反复泛红
#     -
#     肤感也相当不错
#     像水一样的质地，流动性真的很棒
#     说是触肤即化也是毫不夸张，没有丝毫黏腻的感觉
#     依旧是0酒精0矿物油，对敏敏肌相当友好
#     后续再叠加其他护肤品也完全不会出错
#     别说有些晒伤脆弱泛红了，用它那都不是事儿！
#     哪怕姐妹们去做了特殊美丽项目，涂上一层
#     原本泛红的肌肤基本上能恢复如初
#     我现在长期用下来以后 真的感觉皮肤稳稳当当的，
#     再见了！！敏感，泛红😣
#     偷偷告诉你们，8月2号就正式上市了，记得定好闹钟哦
#     姐妹们！真的信我一句
#     放眼整个修红界它都是相当炸裂的存在，一定要给它一次机会啊！
#     雅诗兰黛SOS闪修精华 精华分享 修红精华 拯救敏感肌  修红精华  褪红精华  #雅诗兰黛SOS闪修精华 #精华分享 #修红精华 #拯救敏感肌 #褪红精华""",
#     """《100瓶面霜用完，总决赛选手都在这了》
#     稍微上了点年纪的都知道抗老面霜有多重要，不信你去翻贵妇梳妆台，精华可能就一瓶两瓶，但面霜一定是按摞叠的
#     我也是年龄上来了、猛💊作不动了，才懂抗老面霜的好，几年用下来，挑几瓶我能用一辈子的来讲讲
#     .
#     ☀️ olay信号霜
#     38就写过功课了，618又囤了一瓶，300+买一送一算平价了吧？
#     但能买来整个牌子研究胜肽几十年的资历＆发扬光大了胜肽+植萃的体系、甚至带🔥了胜肽的原料厂商sederma的本事，反正买完那么一瞬间，我是有点恍惚的
#     就说这瓶，4⃣️重信号肽搭配白钻松露直接化身女娲补天石
#     一边打开生产胶原的阀门，一边又筑起防止胶原流失的大坝，给胶原蛋白开源节流
#     不夸张，【抗氧修护➕紧致下颌线】500以下抗老面霜很难找到对手
#     配上羽西鎏金精华3.0，玻色因+胜肽抗老double再double，冲下2k档位的效果不是问题[偷笑R]
#     （小道消息🤫，听说olay信号霜还要升级？能不能单抗2k档位就看这次了）
#     .
#     🌙 Darphin银钻面霜
#     效果到位、肤感绝佳，夸了无数次我真的累了（朵梵你什么时候seeding我银钻大全套❗）
#     特地根据肤质分了三个型号，凝霜和乳霜活性物配置和精华一样，三选一就行
#     最适合干皮的面霜则是另外一套活性体系，有条件的要叠加精华
#     但虽说这俩体系有区别，但框架仍旧逃不过胜肽+植萃的组合
#     并且在olay抗老提拉的基础上强化了修护抗红的效果（玻色因：❓）
#     敏感泛红皮必备，不输专门的敏感肌品牌，又能满足我严苛的抗老需求
#     多提一句，调香惊为天人，海风的咸湿与花草的香甜，说是护肤品天香都不为过
#     .
#     ⭐ 雅诗兰黛黑钻面霜
#     比Darphin再高一个档次，肤感绝对配得上登峰造极四个字，轻薄度堪比Darphin银钻凝霜但保湿续航力却能到银钻乳霜的水平
#     这质地转化感、这羽柔拂面感，一摸就知道贵的有道理，低于4k真找不到这个感觉
#     没啥夸功效的必要了，雅诗兰黛能给的都给了，再提一个档次就上w了[扯脸H]
#     只能说你想要的它都有，而且比你想要的还要多很多
#     .
#     总而言之，想低预算抗老、不花冤枉钱的，认准olay信号霜，紧致提拉一通绝杀
#     有预算、对肤感要求更高就Darphin银钻，正常人到这个档位护肤就毕业了
#     有钱贵妇别纠结，一步到位雅诗兰黛黑钻是真的🉑，贵妇面霜中的女王
#     .
#     面霜推荐  OLAY  OLAY信号霜  羽西鎏金瓶  全新羽西鎏金瓶精华  抗老面霜  Darphin朵梵  雅诗兰黛黑松露  #抗老面霜 #Darphin朵梵 #雅诗兰黛黑松露 #羽西鎏金瓶 #全新羽西鎏金瓶精华 #面霜推荐 #OLAY信号霜 #OLAY"""
# ]
# opt = easytest(text)
# 1
#
#
#
